import { Collapse } from "antd";
import React from "react";
import { Row, Col, Typography } from "antd";
const { Panel } = Collapse;

const data = [
  {
    title: "پەپوو چییە؟",
    content: `پەپوو پلاتفۆرمێکی پەروەردەیی نوێیە ئامانج لێی یارمەتیدانی قوتابیانە بۆ زانینی خاڵی لاوازیان  لە وانەکانیان ،باشتر خۆئامادەکردن بۆ تاقیکردنەوەکان و بەدەستهێنانی نمرەیەکی بەرز.`
  },
  {
    title: "ئامانج لە پەپوو چییە؟ ",
    content: `یارمەتیدانی قوتابیان بۆ زانینی خاڵی لاوازیان  لە وانەکانیان ،باشتر خۆئامادەکردن بۆ تاقیکردنەوەکان و بەدەستهێنانی نمرەیەکی بەرز.`
  },
  {
    title: "پەپوو بەخۆراییە یان بە پارە؟ بۆچی؟",
    content: `لە کاتی دابەزاندن و خۆتۆمارکردن لە پەپوو دەتوانی پەپوو بەکاربێنی بە خۆرایی بۆ ماوەیەکی کاتی و دوای تەواوبوونی ئەم ماوەیە گەر ویستت سوودمەندبیت لە پەپوو پێویستە بە شداربتی لە یەکێک لە پاکێجەکانی پەپوو کە نرخێکی گونجاویان هەیە بۆ قوتابی.`
  },
  {
    title: "بۆچی پێویستە پارە بدەم بۆ پەپوو؟",
    content: `پەپوو کە ئامانجی خزمەتکردنی قوتابیان و گەیاندنی زانست و زانیارییەکانە بە شێوەیەکی راست دروست و سەردەمییانە پێویستی بە کەسانی شارەزە هەیە بۆ ئەوەی دڵنیایی بدەنە قوتابیان کە بەرهەمەکە جێی متمانەیەو بە شێوەیەکی بەردەوام پێداچوونەوەی بۆ دەکرێ. لە ئێستادا زیاتر لە ٢٠ کەسە کار لەسەر پەپوو دەکەن کە پێک دێن لە مامۆستایانی پسپۆر لە وانەکان و کەسانی تەکنیکی کە بەردەوام کار لەسەر باشترکدنی سیستەمەکە دەکەن و بەرەوپێشی دەبەن.`
  },
  {
    title: "نرخی بەشداریکردن لە پەپوو چەندە؟",
    content: `نرخی بەشداریکرندن لە پاکێجێکی پەپوو نزیکەی ٩ هەزار دینارە بۆ ماوەی سێ مانگ کە یەکسانە بە تەنها  ٣ هەزار دینار بۆ هەر مانگێک دوای کۆتاییهاتنی پاکێجەکە دەبێت جارێکی دیکە پاکێجەکە بکڕیت.`
  },
  {
    title: "چی بەدەست دەهێنم دوای کڕینی پاکێجێکی پەپوو وە ئایا گۆرانکاری نوێ بەردەست دەخەن؟ ",
    content: (<>
      <p style={{ textDecoration: 'underline' }}>لە ئێستادا ئەم خاڵنەی خوارە هەموویان بەردەستن لە پەپوو :</p>
      <ul>
        <li>زیاتر لە ٢٥٠٠ پرسیاری وزاری و بەشێکی زۆری پرسیارەکان شیکاریشیان لەگەڵدایە</li>
        <li>ئەنجامدانی تاقیکردنەوە و هەڵبژاردنی کات و ژمارەی پرسیار</li>
        <li>دیاریکردنی تاقیکردنەوەکان بە پێی بەند و بابەت</li>
        <li>هەندێک نەخشە و زانیاری بەسوود لەسەر قوتابی بۆ ئەوەی ئاستی خۆی باشتر بزانێت</li>
        <li>دووبارەکردنەوەی تاقیکردنەوەیەک کە پێشووتر کردوتە</li>
        <li>شەیرکردنی پرسیارەکانی پەپوو لەگەڵ هاوڕێیانت</li>
      </ul>
      <p style={{ textDecoration: 'underline' }}>لە داهاتوو کار لە سەر زیادکرنی ئەم خاڵانە دەکەین : :</p>
      <ul>
        <li>زیادکردنی گشت پرسیارەکانی وزارە و گەیاندنی بە ٧٠٠٠ پرسیار</li>
        <li>زیادکردنی پرسیارەکانی ڕێبەری قوتابی ئەسیلەی تایبەت بە مامۆستا</li>
        <li>زیادکردنی فلاشکارد (ڕێگایەکی سەردەمیانە بۆ یارمەتیدانی قوتابییان بۆ ئاسانتر بیهاتنەوەی بابەتەکان)</li>
        <li>لیستی باشترین قوتابیانی مانگ</li>
        <li>نیشاندانی نەخشە و زیانیاری زۆرتر دەبارەی خۆت، بۆ ئەوەی لایەنە لاوازەکانت دەستنیشان بکەیت</li>
      </ul>
    </>)
  },
  {
    title: 'سەرچاوەی پرسیار و وەڵامەکانی پەپوو کوێن و کێ ئامادەی دەکات؟',
    content: `لە ئێستادا هەموو ئەو پرسیارەنەی کە لە پەپوو بەردەستن پرسیاری تاقیکردنەوەی نیشتیمانین کە لە لایەن مامۆستایانی پسپۆر لە تیمی پەپوو شیکارییان بۆ کراوە وە بە بەردەوام پێداچوونەوەی بۆ دەکرێ.`
  },
  {
    title: 'پەپوو بۆ چ پۆلێک بەردەستە؟ ',
    content: `لە ئێستادا پەپوو بەردەستە بۆ پۆلی ١٢ ی  وێژەیی\زانستی و پۆلی ٩. بەڵام ئێمە لێرە ناوەستین ، بەڵکو هەوڵ دەدەین لە ساڵی داهاتوو پەپوو بەردەست بخەین بۆ زۆرترین پۆل و قۆناغ کە لەتوانانماندایە. `
  },
  {
    title: 'چۆن بتوانم زۆرترین سوود لە پەپوو ببینم؟ ',
    content: `یەکێک لەو خاڵە سەرەکییانەی کە پەپوو کاری لەسەر دەکات ئەوەیە قوتابی خاڵی لاوازی خۆی بزانێت و بێ ترس بچێتە هۆڵەکانی تاقیکردنەوە وە ئەمەشیان بە هەوڵێکی دوولایەنە دەکرێ. لاینی یەکەم کە پەپووە زۆرترین پرسیار و شیکاری بە کوالێتیەکی بەرز بەردەست بخات. لایەنی دووەم کە تۆی قوتابی بە شێوەیەکی بەردەوام ، ڕۆژانە یان هەفتانە ئەو وانانەی کە لە قوتابخانە یان خۆت دەیخوێنی خۆتی لێ تاقیبکەیەتەوە لە رێگەی پەپوو وە چاودێری نمرەکانت بکەیت لە ڕێگەی بەشی  دەرباری من لە ناو ئاپی پەپوو و کۆششی زیاتر بکەیت لەو وانانەی نمرەکانت تیایدا وەک پێویست نییە.`
  },
  {
    title: 'چۆن خۆم تۆمار بکەم لە پەپوو؟',
    content: (<>
      <iframe width="100%" height="415" src="https://www.youtube.com/embed/DIrCREsDaE4" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
    </>)
  },
  {
    title: 'چۆن تاقیکرندەوە بکەم لە پەپوو؟ ',
    content: (<>
      <iframe width="100%" height="415" src="https://www.youtube.com/embed/PeEXAqyqazQ" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
    </>)
  },
  {
    title: 'چۆن پاکێجێکی پەپوو بەدەس بهێنم؟',
    content: (<>
      <iframe width="100%" height="415" src="https://www.youtube.com/embed/TNri2w_tFSg" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
    </>)
  },


];

const Faq = () => (
  <>
    <Typography className="faq-header">پرسیارە باوەکان</Typography>
    <Typography className="faq-paragraph">
      لێرە هەوڵدەدەین وەڵامی پرسیارە گشتیەکانتان بدەینەوە لە ئەگەری هەبوونی
      پرسیاری زیاتر پەیوەندیمان پێوە بکەن
    </Typography>
    <Row align="middle" justify="center" style={{ padding: "10px" }}>
      <Col lg={18} md={18} sm={24} xs={24}>
        <Collapse bordered={false} style={{ background: 'white', fontSize: '1.1rem' }} accordion>
          {data.map((item, index) => (
            <Panel key={index + 1} header={item.title}>
              <p>{item.content}</p>
            </Panel>
          ))}
        </Collapse>
      </Col>
    </Row>
  </>
);
export default Faq;
